tests/Unit/SwedbankPayTest/Api/Service/Paymentorder/V3/Request/sampleCaptureResponseV3.json

{
    "paymentOrder": {
        "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407",
        "created": "2023-12-08T14:06:29.0250114Z",
        "updated": "2023-12-08T14:07:48.9872240Z",
        "operation": "Purchase",
        "status": "Paid",
        "currency": "SEK",
        "amount": 100,
        "vatAmount": 0,
        "remainingReversalAmount": 100,
        "description": "Test Purchase",
        "initiatingSystemUserAgent": "PostmanRuntime/7.35.0",
        "language": "sv-SE",
        "availableInstruments": ["CreditCard", "Swish"],
        "implementation": "PaymentsOnly",
        "integration": "Redirect",
        "instrumentMode": false,
        "guestMode": false,
        "paid": {
            "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/paid",
            "number": 40128372054,
            "instrument": "CreditCard",
            "payeeReference": "1702044389",
            "transactionType": "Authorization",
            "amount": 100,
            "submittedAmount": 100,
            "feeAmount": 0,
            "discountAmount": 0,
            "details": {
                "nonPaymentToken": "6e7f3a0b-3d4d-46a7-8d13-6b15180896a2",
                "externalNonPaymentToken": "91dd1ea0eeafc2ac397d24e80abdc",
                "cardBrand": "MasterCard",
                "cardType": "Credit",
                "maskedPan": "522661******3406",
                "expiryDate": "12/2033",
                "issuerAuthorizationApprovalCode": "L25647",
                "acquirerTransactionType": "3DSECURE",
                "acquirerStan": "25647",
                "acquirerTerminalId": "40128372054",
                "acquirerTransactionTime": "2023-12-08T14:06:46.536Z",
                "transactionInitiator": "CARDHOLDER",
                "bin": "522661"
            }
        },
        "financialTransactions": {
            "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/financialtransactions",
            "financialTransactionsList": [
                {
                    "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/financialtransactions/uuid1",
                    "created": "2023-12-08T14:06:46.0Z",
                    "updated": "2023-12-08T14:06:46.5Z",
                    "type": "Authorization",
                    "number": 40128372054,
                    "amount": 100,
                    "vatAmount": 0,
                    "description": "Authorizing the payment",
                    "payeeReference": "1702044389"
                },
                {
                    "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/financialtransactions/uuid2",
                    "created": "2023-12-08T14:07:48.889224Z",
                    "updated": "2023-12-08T14:07:48.971819Z",
                    "type": "Capture",
                    "number": 40128372069,
                    "amount": 100,
                    "vatAmount": 0,
                    "description": "Capturing the authorized payment",
                    "payeeReference": "1702044467",
                    "orderItems": {
                        "id": "/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/financialtransactions/uuid2/orderitems"
                    }
                }
            ]
        }
    },
    "operations": [
        {
            "method": "POST",
            "href": "https://api.externalintegration.payex.com/psp/paymentorders/d4c5684f-c2dc-4c18-680d-08dbf62de407/reversals",
            "rel": "reversal",
            "contentType": "application/json"
        }
    ]
}
